<!DOCTYPE html>
<html lang="en">
<head>
<title>Жанри</title>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="style.css">
</head>
<body>

<div class="header">
<h1>Дивитись фільми та серіали онлайн українською</h1>
<p>У чудовій якості та якісній озвучці</p>
</div>

<div class="navbar">
  <a href="./index.php">Головна сторінка</a>
  <a href="./index2.php">Жанри</a>
</div>

<div class="row">
  <div class="side">
      <div class="a" id="clock">16:23:04</div>
      <script src="js.js"></script>
      <div class="data"><?php echo date("d.m.y");?></div>
  </div>
  
<div class="main">
	<p>Найпопулярніші кіножанри:</p>
	<ul>
	    <li>Екшн</li>
	    <li>Пригодницький фільм </li>
	    <li>Детективний фільм </li>
	    <li>Фільм-драма</li>
	    <li>Історичний фільм</li>
	    <li>Кінокомедія</li>
	    <li>Мелодрама </li>
	    <li>Сімейний фільм </li>
	    <li>Музичний фільм</li>
	    <li>Трилер</li>
	    <li>Фільм жахів</li>
	    <li>Фантастичний фільм</li>
	</ul>
	<table border="1" width="80%" height="30%">
	    <caption>Класифікація кіножанрів</caption>
	    <tr>
	        <td rowspan="4">Екшн</td>
	        <td>Вестерн</td>
	        <td>у класичних фільмах цього жанру дія відбувається на дикому Заході Америки в XIX столітті. Конфлікт звичайно розгортається між 
	            бандою злочинців, представниками влади й мисливцями за нагородою (англ. bounty hunter). Як і у звичайному екшн-фільмі, конфлікт вирішується 
	            насильством зі стріляниною. Вестерни просочені атмосферою волі й незалежності, характерної для заходу Сполучених Штатів.</td>
	    </tr>
	    <tr>    
	        <td>Гангстерський фільм</td>
	        <td>дія фільмів цього піджанру найчастіше відбувається в США в 1930-і роки — під час розквіту гангстерських угруповань.
	             «Розбирання» між гангстерами і є основою сюжету таких фільмів.</td>
	    </tr>
	    <tr>
	        <td>Кіно бойових мистецтв</td>
	        <td>фільми цього піджанру сюжетно мало відрізняються від звичайних фільмів жанру екшн. Але в протистоянні персонажів карате-фільмів ставка робиться не на застосування вогнепальної зброї, а на рукопашні сутички із застосуванням прийомів східних бойових мистецтв, наприклад, карате.</td>
	    </tr>
	    <tr>
	        <td>Гірський фільм </td>
	        <td>звеличує красу природи та розкриває драматизм зусиль альпіністів підкорювачів вершин.</td>
	    </tr>
	    <tr>
	        <td rowspan="2">Фільм-драма</td>
	        <td>Трагедія</td>
	        <td>напевно театральну трагедію не слід розглядати як окремий випадок драми, але в кінематографі це в принципі вірно. Основу трагедії також становить зіткнення особистості зі світом, суспільством, долею, вираження в боротьбі сильних характерів і страстей. Але, на відміну від звичайної драми, трагічна колізія звичайно завершується загибеллю головного героя.</td>
	    </tr>
	    <tr>
	        <td>Камершпіле</td>
	        <td>різновид драми, що склався у німецькому театрі, мистецтві й кіно на початку 1920-х, характерними ознаками якого є психологізм на межі з натуралізмом, намагання розкрити внутрішню сутність зазвичай нечисленних персонажів — представників середнього бюргерства і чиновництва, соціальний песимізм..</td>
	    </tr>
	    <tr>
	        <td>Історичний фільм</td>
	        <td>Військовий фільм</td>
	        <td>назва говорить саме за себе, це фільми про війну</td>
	    </tr>
	    <tr>
	        <td rowspan="5">Кінокомедія</td>
	        <td>Комедія станів (ситуацій)</td>
	        <td>це класичний вид комедії, заснований на тому, що герої фільму потрапляють у курйозні, смішні становища. Найчастіше сценарій пишуть саме у такому піджанрі. Такі фільми часто зрозумілі людям різних поколінь.</td>
	    </tr>
	    <tr>
	        <td>Комедія характерів</td>
	        <td>це класичний вид комедії, заснований на тому, що комічне фільму базується на смішних особливостях персонажа (англ. character — «персонаж», звідси й назва піджанру), Такі фільми, як правило, «живуть» лише у своїй епосі, і часто незрозумілі людям інших поколінь.</td>
	    </tr>
	    <tr>
	        <td>Чорна комедія</td>
	        <td>комедія, побудована на використанні «чорного» гумору. «Чорні» комедії за предмет своєї забави мають відкидання моральних цінностей, що викликають похмуру посмішку</td>
	    </tr>
	    <tr>
	        <td>Пародія</td>
	        <td>вид комедії, що базується на пародіюванні чого-небудь (наприклад, на пародіюванні інших фільмів).</td>
	    </tr>
	    <tr>
	        <td>Фарс</td>
	        <td>комедія легкого змісту із чисто зовнішніми комічними прийомами.</td>
	    </tr>
	</table>
	<p>Найрейтинговіших фільм IMDb:</p>
	<img src="https://upload.wikimedia.org/wikipedia/uk/8/87/%D0%92%D1%82%D0%B5%D1%87%D0%B0_%D0%B7_%D0%A8%D0%BE%D1%83%D1%88%D0%B5%D0%BD%D0%BA%D0%B0.jpg" alt="Втеча з Шоушенка" title="Втеча з Шоушенка" width="300" height="435" />
	<iframe width="560" height="315" src="https://www.youtube.com/embed/PLl99DlL6b4" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
	<div>
		<h2>Коментарі</h2>
	    <form method="post">  
	    Name: <input type="text" name="name">
	    <br><br>
	    E-mail: <input type="text" name="email">
	    <br><br>
	    Comment: <textarea name="comment" rows="5" cols="40"></textarea>     
	    <br><br>
	    <input type="submit" name="submit" value="Відправити">  
	    </form>
	    <div class="com">
	    <?php 
	    $file_name = "index2.txt";
	    include 'write_file.php';
		?>
		
		<?php include 'read_file.php';?>
	</div>
</div>

  
</body>
</html>